; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v6 - type_3 ?v8 - type_1)
 	      (pred_4 ?v5 - object ?v8 - type_1)
	      (pred_1 ?v6 - type_3 ?v2 - type_2)
	      (pred_3 ?v6 - type_3 ?v5 - object ?v2 - type_2))

   (:action op_3
       :parameters  (?v6 - type_3 ?v7 ?v4 - type_1)
       :precondition (and  (pred_2 ?v6 ?v7))
       :effect (and  (pred_2 ?v6 ?v4)
		     (not (pred_2 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_3 ?v1 - object ?v3 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_2 ?v6 ?v3) (pred_1 ?v6 ?v2))
       :effect (and (pred_3 ?v6 ?v1 ?v2)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_3 ?v1 - object ?v3 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v1 ?v2) (pred_2 ?v6 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_1 ?v6 ?v2)
		    (not (pred_3 ?v6 ?v1 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_12 - type_3
obj_02 obj_04 obj_07 obj_14 - type_2
obj_03 obj_10 obj_13 obj_06 - type_1
obj_11 obj_09 obj_08 obj_01 - object)
(:init
(pred_2 obj_05 obj_06)
(pred_1 obj_05 obj_02)
(pred_1 obj_05 obj_04)
(pred_2 obj_12 obj_06)
(pred_1 obj_12 obj_07)
(pred_1 obj_12 obj_14)
(pred_4 obj_11 obj_03)
(pred_4 obj_09 obj_06)
(pred_4 obj_08 obj_06)
(pred_4 obj_01 obj_03)
)
(:goal
(and
(pred_4 obj_11 obj_03)
(pred_4 obj_09 obj_03)
(pred_4 obj_08 obj_03)
(pred_4 obj_01 obj_13)
)
)

(:constraints
  (always (not (pred_2 obj_05 obj_13)))
)
)

; plan
1. (op_2 obj_05 obj_09 obj_06 obj_02)
   deleted: (pred_4 obj_09 obj_06) (pred_1 obj_05 obj_02)
   added: (pred_3 obj_05 obj_09 obj_02)
   goals met: 1 of 4
2. (op_2 obj_05 obj_08 obj_06 obj_04)
   deleted: (pred_4 obj_08 obj_06) (pred_1 obj_05 obj_04)
   added: (pred_3 obj_05 obj_08 obj_04)
   goals met: 1 of 4
3. (op_3 obj_12 obj_06 obj_13)
   deleted: (pred_2 obj_12 obj_06)
   added: (pred_2 obj_12 obj_13)
   goals met: 1 of 4
4. (op_3 obj_05 obj_06 obj_03)
   deleted: (pred_2 obj_05 obj_06)
   added: (pred_2 obj_05 obj_03)
   goals met: 1 of 4
5. (op_3 obj_12 obj_13 obj_03)
   deleted: (pred_2 obj_12 obj_13)
   added: (pred_2 obj_12 obj_03)
   goals met: 1 of 4
6. (op_1 obj_05 obj_08 obj_03 obj_04)
   deleted: (pred_3 obj_05 obj_08 obj_04)
   added: (pred_4 obj_08 obj_03) (pred_1 obj_05 obj_04)
   goals met: 2 of 4
7. (op_1 obj_05 obj_09 obj_03 obj_02)
   deleted: (pred_3 obj_05 obj_09 obj_02)
   added: (pred_4 obj_09 obj_03) (pred_1 obj_05 obj_02)
   goals met: 3 of 4
8. (op_2 obj_12 obj_01 obj_03 obj_14)
   deleted: (pred_4 obj_01 obj_03) (pred_1 obj_12 obj_14)
   added: (pred_3 obj_12 obj_01 obj_14)
   goals met: 3 of 4
9. (op_3 obj_12 obj_03 obj_13)
   deleted: (pred_2 obj_12 obj_03)
   added: (pred_2 obj_12 obj_13)
   goals met: 3 of 4
10. (op_1 obj_12 obj_01 obj_13 obj_14)
   deleted: (pred_3 obj_12 obj_01 obj_14)
   added: (pred_4 obj_01 obj_13) (pred_1 obj_12 obj_14)
   goals met: 4 of 4
